In [1]:
import pandas as pd

In [2]:
list_example=[5,4,6,9,3,6,9,3,69]

In [3]:
list_example

[5, 4, 6, 9, 3, 6, 9, 3, 69]

In [5]:
pd.DataFrame(data= list_example,columns = ["values"],dtype = "float")

   values
0     5.0
1     4.0
2     6.0
3     9.0
4     3.0
5     6.0
6     9.0
7     3.0
8    69.0

In [6]:
import numpy as np

In [7]:
array_example = np.random.randint(0,50, (4,4))

array_example

In [8]:
array_example

array([[44,  9, 44,  1],
       [ 9,  0, 15, 40],
       [ 4,  0, 36, 18],
       [ 0, 13, 37, 23]])

In [9]:
df = pd.DataFrame(array_example, index =["a","b","c","d"],columns =["1","2","3","4"])

In [10]:
df

    1   2   3   4
a  44   9  44   1
b   9   0  15  40
c   4   0  36  18
d   0  13  37  23

In [11]:
x = np.random.randint(10,50,size=6)

In [12]:
x

array([48, 24, 16, 47, 12, 48])

In [13]:
y = np.random.randint(10,50,size=6)
z = np.random.randint(10,50,size=6)
a = np.random.randint(10,50,size=6)

In [14]:
dict_example = {"val1" :x ,"val2":y,"val3":z,"val4":a}

In [15]:
dict_example

{'val1': array([48, 24, 16, 47, 12, 48]),
 'val2': array([24, 11, 35, 42, 15, 46]),
 'val3': array([34, 49, 45, 30, 16, 15]),
 'val4': array([29, 16, 42, 15, 39, 37])}

In [16]:
df = pd.DataFrame(dict_example)

In [17]:
df

   val1  val2  val3  val4
0    48    24    34    29
1    24    11    49    16
2    16    35    45    42
3    47    42    30    15
4    12    15    16    39
5    48    46    15    37

In [18]:
df.head()

   val1  val2  val3  val4
0    48    24    34    29
1    24    11    49    16
2    16    35    45    42
3    47    42    30    15
4    12    15    16    39

In [19]:
df.head(3)

   val1  val2  val3  val4
0    48    24    34    29
1    24    11    49    16
2    16    35    45    42

In [20]:
df.tail()

   val1  val2  val3  val4
1    24    11    49    16
2    16    35    45    42
3    47    42    30    15
4    12    15    16    39
5    48    46    15    37

In [21]:
df.tail(2)

   val1  val2  val3  val4
4    12    15    16    39
5    48    46    15    37

In [22]:
df.columns

Index(['val1', 'val2', 'val3', 'val4'], dtype='object')

In [26]:
[i for i in df.columns]

['val1', 'val2', 'val3', 'val4']

In [27]:
df.values

array([[48, 24, 34, 29],
       [24, 11, 49, 16],
       [16, 35, 45, 42],
       [47, 42, 30, 15],
       [12, 15, 16, 39],
       [48, 46, 15, 37]])

In [28]:
df.columns = ["new1","new2","new3","new4"]

In [29]:
df

   new1  new2  new3  new4
0    48    24    34    29
1    24    11    49    16
2    16    35    45    42
3    47    42    30    15
4    12    15    16    39
5    48    46    15    37

In [30]:
type(df.values)

numpy.ndarray

In [31]:
type(df)

pandas.core.frame.DataFrame

In [32]:
df.shape

(6, 4)

In [33]:
df.ndim

2

In [36]:
np.random.seed(101)
df = pd.DataFrame(data = np.random.randn(6,5), index = "A B C D E F".split(),columns = ["VAL1 VAL2 VAL3 VAL4 VAL5".split()])

In [37]:
df

       VAL1      VAL2      VAL3      VAL4      VAL5
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841
F  0.390528  0.166905  0.184502  0.807706  0.072960

In [38]:
df["VAL1"]

       VAL1
A  2.706850
B -0.319318
C  0.528813
D  0.955057
E  0.302665
F  0.390528

In [39]:
df[["VAL1"]]["B":"D"]

       VAL1
B -0.319318
C  0.528813
D  0.955057

In [40]:
df[["VAL1"]][1:4]

       VAL1
B -0.319318
C  0.528813
D  0.955057

In [43]:
df[["VAL1","VAL2"]]

       VAL1      VAL2
A  2.706850  0.628133
B -0.319318 -0.848077
C  0.528813 -0.589001
D  0.955057  0.190794
E  0.302665  1.693723
F  0.390528  0.166905

In [44]:
variable = ["VAL1","VAL2"]

In [45]:
df[variable]

       VAL1      VAL2
A  2.706850  0.628133
B -0.319318 -0.848077
C  0.528813 -0.589001
D  0.955057  0.190794
E  0.302665  1.693723
F  0.390528  0.166905

In [46]:
df["B":"E"]

       VAL1      VAL2      VAL3      VAL4      VAL5
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [47]:
df[1:4]

       VAL1      VAL2      VAL3      VAL4      VAL5
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [48]:
df["E"]

KeyError: 'E'

In [49]:
df["E":"E"]

       VAL1      VAL2      VAL3      VAL4      VAL5
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [51]:
df["E":"E"][["VAL3","VAL4"]]

       VAL3      VAL4
E -1.706086 -1.159119